app/controllers/products_controller.rb

SELECT "products".* FROM "products" ORDER BY name ASC
---
  def index
  	@products = Product.all

INSERT INTO "products" ("created_at", "description", "master_product_id", "name", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Mon, 11 Aug 2014 13:50:15 UTC +00:00], ["description", "this is master procuts"], ["master_product_id", 18], ["name", "dell"], ["updated_at", Mon, 11 Aug 2014 13:50:15 UTC +00:00]]
---
  def create
  	@product = Product.create(params[:product])