app/views/products/index.html.haml

          .controls
            = p.select :master_product_id, options_for_select(Product.order("name ASC").map {|pt| [pt.name, pt.id]}) if Product.any?
        .control-group
          .controls
---
SELECT "products".* FROM "products" ORDER BY name ASC
SELECT COUNT(*) FROM "products"

              %td
                = p.master_product.name if p.master_product.present?
---
SELECT "products".* FROM "products" WHERE "products"."master_product_id" = $1  [["master_product_id", 17]]